code-review/NRB_3471_3546/База_Стало/DataProcessors/ОбработкаВнешнихЗапросовRequest.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаВнешнихЗапросовRequest</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналВходящихСообщенийKafka.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналВходящихСообщенийKafka</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ключ</Name>
					<Comment>Ключ (key) сообщения Kafka</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбработкиСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешнийИсточник</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВнешниеИсточники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ОбработкаВнешнихЗапросовRequest/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура для обработки сообщений Request от Kafka
//
// Параметры:
//  Выборка	 - ВыборкаИзРезультатаЗапроса - Выборка данных из РС ЖурналВходящихСообщенийKafka
//
Процедура ВыполнитьСоздание(Выборка) Экспорт
	
	ИмяСобытия = "ОбработкаВнешнихЗапросовRequest";
	Сообщение = РаботаСJSON.РезультатЧтенияJSON(Выборка.Сообщение);
	ТекстОшибки = "";
	Попытка
		MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
		ОбменДаннымиКафка.ПодготовитьMessageInfo(Сообщение.MessageInfo, MessageInfo, ИмяСобытия, ТекстОшибки);
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ТекстОшибки = "";
		ПроверитьData(Сообщение, ТекстОшибки);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ВызватьИсключение "Не заполнены обязательные поля JSON. Обработка запроса прервана.";
		КонецЕсли;
		
		ТекстОшибки = "";
		ОбработатьЗапрос(Сообщение, ТекстОшибки);
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ВызватьИсключение "При обработке запроса произошли ошибки";
		Иначе
			РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗавершитьОбработку(Выборка.ВнешнийИсточник, Выборка.Идентификатор);
		КонецЕсли;
		
	Исключение
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) + Символы.ПС + ТекстОшибки;
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		MessageInfo.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	КонецПопытки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РегистрыСведений.ЖурналВходящихСообщенийKafka.ЗаписатьОшибку(Выборка.ВнешнийИсточник, Выборка.Идентификатор, СокрЛП(ТекстОшибки));
		ОбменДаннымиКафка.ОбработатьОшибкуДанныхИзJSON(ИмяСобытия, MessageInfo, СокрЛП(ТекстОшибки));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьData(ДанныеИзJSON, ТекстОшибки)
	
	ОбязательныеПоля = "RequestType,RequestSystem";
	ПроверятьЗаполненность = Истина;
	РаботаСJSON.ПроверитьОбязательныеПоля(ДанныеИзJSON.Data, ОбязательныеПоля, ТекстОшибки, ПроверятьЗаполненность);
	
КонецПроцедуры

Процедура ОбработатьЗапрос(Сообщение, ТекстОшибки)
	
	Data = Сообщение.Data;
	ЭтоСообщениеДляДепо = (ВРег(Data.RequestSystem) = "DEPO");
	Если ВРег(Data.RequestType) = "SECURITIESQUOTES"
		И ЭтоСообщениеДляДепо Тогда
		ФорматДаты = ФорматДатыJSON.ISO;
		ТекстыОшибок = Новый Массив;
		ВыгрузкаКотировокВBackQort = Обработки.ВыгрузкаКотировокВBackQort.Создать();
		ВыгрузкаКотировокВBackQort.НачалоПериода = ПрочитатьДатуJSON(Data.DateStart, ФорматДаты);
		ВыгрузкаКотировокВBackQort.КонецПериода = ПрочитатьДатуJSON(Data.DateEnd, ФорматДаты);
		ПрочитатьПараметрыЗапросаИЗаполнитьОтборОбработки(Data, ВыгрузкаКотировокВBackQort);
		ВыгрузкаКотировокВBackQort.ВыгрузитьВBackQort(Сообщение.MessageInfo.MasterMessageId, Сообщение.MessageInfo.MessageId,
			ТекстыОшибок);
		ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
	КонецЕсли;
	Если ВРег(Data.RequestType) = "ACI"
		И ЭтоСообщениеДляДепо Тогда
		ФорматДаты = ФорматДатыJSON.ISO;
		ТекстыОшибок = Новый Массив;
		ВыгрузкаНКДВBackQort = Обработки.ВыгрузкаНКДВBackQort.Создать();
		ВыгрузкаНКДВBackQort.НачалоПериода = ПрочитатьДатуJSON(Data.DateStart, ФорматДаты);
		ВыгрузкаНКДВBackQort.КонецПериода = ПрочитатьДатуJSON(Data.DateEnd, ФорматДаты);
		ПрочитатьПараметрыЗапросаИЗаполнитьОтборОбработки(Data, ВыгрузкаНКДВBackQort);
		ВыгрузкаНКДВBackQort.ВыгрузитьВBackQort(Сообщение.MessageInfo.MasterMessageId, Сообщение.MessageInfo.MessageId,
			ТекстыОшибок);
		ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
	КонецЕсли;
	Если ВРег(Data.RequestType) = "OPERATIONTAX"
		И ЭтоСообщениеДляДепо Тогда
		ФорматДаты = ФорматДатыJSON.ISO;
		ТекстыОшибок = Новый Массив;
		НачалоПериода = ПрочитатьДатуJSON(Data.DateStart, ФорматДаты);
		КонецПериода = ПрочитатьДатуJSON(Data.DateEnd, ФорматДаты);
		ОбработкаЗапросовПоНалогам = Обработки.ОбработкаЗапросовПоНалогамОтДиасофт.Создать();
		ОбработкаЗапросовПоНалогам.ВыгрузитьДанныеПоНалогам(НачалоПериода, КонецПериода,
			Сообщение.MessageInfo.MessageId, ТекстыОшибок);
		ТекстОшибки = СтрСоединить(ТекстыОшибок, Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьПараметрыЗапросаИЗаполнитьОтборОбработки(Data, ОбработкаВыгрузкиВBackQort)
	Parameters = Data.Parameters;
	Assets = Неопределено;
	SourceAPI = Неопределено;
	Если Parameters.Свойство("Assets", Assets) И ЗначениеЗаполнено(Assets) Тогда
		ОбработатьКоллекциюAssets(Assets, ОбработкаВыгрузкиВBackQort);
	КонецЕсли;
	Если Parameters.Свойство("SourceAPI", SourceAPI) И ЗначениеЗаполнено(SourceAPI) Тогда
		ОбработкаВыгрузкиВBackQort.Биржа = ИсточникКотировокПоSourceAPI(SourceAPI);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьКоллекциюAssets(Assets, ВыгрузкаКотировокВBackQort)
	Для Каждого Asset Из Assets Цикл
		RegNum = Неопределено;
		AssetCode = Неопределено;
		ЦеннаяБумага = Неопределено;
		Если Asset.Свойство("AssetCode", AssetCode) И ЗначениеЗаполнено(AssetCode) Тогда
			ЦеннаяБумага = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоКодуЗагрузкиНДЦ(AssetCode, ТекущаяДатаСеанса());
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЦеннаяБумага) Тогда
			Asset.Свойство("RegNum", RegNum);
			ЦеннаяБумага = Справочники.ЦенныеБумаги.ЦеннаяБумагаПоРегНомеруИISIN(Asset.Isin, RegNum);
		КонецЕсли;
		НоваяСтрока = ВыгрузкаКотировокВBackQort.ЦенныеБумаги.Добавить();
		НоваяСтрока.ЦеннаяБумага = ЦеннаяБумага;
	КонецЦикла;
	ВыгрузкаКотировокВBackQort.ЦенныеБумаги.Свернуть("ЦеннаяБумага");
КонецПроцедуры

Функция ИсточникКотировокПоSourceAPI(SourceAPI)
	Если ВРег(SourceAPI) = "CBONDS" Тогда
		Возврат Справочники.ИнформационноАналитическиеСистемы.CBonds;
	ИначеЕсли ВРег(SourceAPI) = "NSD" Тогда
		Возврат Справочники.ИнформационноАналитическиеСистемы.НРД;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти
